ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DB32def.inc
; Resolution selection
.equ ADC_RESSEL_12BIT_gc = (0x00<<2)     ; 12-bit mode
.equ ADC_RESSEL_10BIT_gc = (0x01<<2)     ; 10-bit mode

; Accumulation Samples select
.equ ADC_SAMPNUM_NONE_gc = (0x00<<0)     ; No accumulation
.equ ADC_SAMPNUM_ACC2_gc = (0x01<<0)     ; 2 results accumulated
.equ ADC_SAMPNUM_ACC4_gc = (0x02<<0)     ; 4 results accumulated
.equ ADC_SAMPNUM_ACC8_gc = (0x03<<0)     ; 8 results accumulated
.equ ADC_SAMPNUM_ACC16_gc = (0x04<<0)    ; 16 results accumulated
.equ ADC_SAMPNUM_ACC32_gc = (0x05<<0)    ; 32 results accumulated
.equ ADC_SAMPNUM_ACC64_gc = (0x06<<0)    ; 64 results accumulated
.equ ADC_SAMPNUM_ACC128_gc = (0x07<<0)   ; 128 results accumulated

; Clock Pre-scaler select
.equ ADC_PRESC_DIV2_gc = (0x00<<0)       ; CLK_PER divided by 2
.equ ADC_PRESC_DIV4_gc = (0x01<<0)       ; CLK_PER divided by 4
.equ ADC_PRESC_DIV8_gc = (0x02<<0)       ; CLK_PER divided by 8
.equ ADC_PRESC_DIV12_gc = (0x03<<0)      ; CLK_PER divided by 12
.equ ADC_PRESC_DIV16_gc = (0x04<<0)      ; CLK_PER divided by 16
.equ ADC_PRESC_DIV20_gc = (0x05<<0)      ; CLK_PER divided by 20
.equ ADC_PRESC_DIV24_gc = (0x06<<0)      ; CLK_PER divided by 24
.equ ADC_PRESC_DIV28_gc = (0x07<<0)      ; CLK_PER divided by 28
.equ ADC_PRESC_DIV32_gc = (0x08<<0)      ; CLK_PER divided by 32
.equ ADC_PRESC_DIV48_gc = (0x09<<0)      ; CLK_PER divided by 48
.equ ADC_PRESC_DIV64_gc = (0x0A<<0)      ; CLK_PER divided by 64
.equ ADC_PRESC_DIV96_gc = (0x0B<<0)      ; CLK_PER divided by 96
.equ ADC_PRESC_DIV128_gc = (0x0C<<0)     ; CLK_PER divided by 128
.equ ADC_PRESC_DIV256_gc = (0x0D<<0)     ; CLK_PER divided by 256

; Initial Delay Selection
.equ ADC_INITDLY_DLY0_gc = (0x00<<5)     ; Delay 0 CLK_ADC cycles
.equ ADC_INITDLY_DLY16_gc = (0x01<<5)    ; Delay 16 CLK_ADC cycles
.equ ADC_INITDLY_DLY32_gc = (0x02<<5)    ; Delay 32 CLK_ADC cycles
.equ ADC_INITDLY_DLY64_gc = (0x03<<5)    ; Delay 64 CLK_ADC cycles
.equ ADC_INITDLY_DLY128_gc = (0x04<<5)   ; Delay 128 CLK_ADC cycles
.equ ADC_INITDLY_DLY256_gc = (0x05<<5)   ; Delay 256 CLK_ADC cycles

; Sampling Delay Selection
.equ ADC_SAMPDLY_DLY0_gc = (0x00<<0)     ; Delay 0 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY1_gc = (0x01<<0)     ; Delay 1 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY2_gc = (0x02<<0)     ; Delay 2 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY3_gc = (0x03<<0)     ; Delay 3 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY4_gc = (0x04<<0)     ; Delay 4 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY5_gc = (0x05<<0)     ; Delay 5 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY6_gc = (0x06<<0)     ; Delay 6 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY7_gc = (0x07<<0)     ; Delay 7 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY8_gc = (0x08<<0)     ; Delay 8 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY9_gc = (0x09<<0)     ; Delay 9 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY10_gc = (0x0A<<0)    ; Delay 10 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY11_gc = (0x0B<<0)    ; Delay 11 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY12_gc = (0x0C<<0)    ; Delay 12 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY13_gc = (0x0D<<0)    ; Delay 13 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY14_gc = (0x0E<<0)    ; Delay 14 CLK_ADC cycles
.equ ADC_SAMPDLY_DLY15_gc = (0x0F<<0)    ; Delay 15 CLK_ADC cycles

; Window Comparator Mode select
.equ ADC_WINCM_NONE_gc = (0x00<<0)       ; No Window Comparison
.equ ADC_WINCM_BELOW_gc = (0x01<<0)      ; Below Window
.equ ADC_WINCM_ABOVE_gc = (0x02<<0)      ; Above Window
.equ ADC_WINCM_INSIDE_gc = (0x03<<0)     ; Inside Window
.equ ADC_WINCM_OUTSIDE_gc = (0x04<<0)    ; Outside Window

; Analog Channel Selection Bits
.equ ADC_MUXNEG_AIN0_gc = (0x00<<0)      ; ADC input pin 0
.equ ADC_MUXNEG_AIN1_gc = (0x01<<0)      ; ADC input pin 1
.equ ADC_MUXNEG_AIN2_gc = (0x02<<0)      ; ADC input pin 2
.equ ADC_MUXNEG_AIN3_gc = (0x03<<0)      ; ADC input pin 3
.equ ADC_MUXNEG_AIN4_gc = (0x04<<0)      ; ADC input pin 4
.equ ADC_MUXNEG_AIN5_gc = (0x05<<0)      ; ADC input pin 5
.equ ADC_MUXNEG_AIN6_gc = (0x06<<0)      ; ADC input pin 6
.equ ADC_MUXNEG_AIN7_gc = (0x07<<0)      ; ADC input pin 7
.equ ADC_MUXNEG_AIN8_gc = (0x08<<0)      ; ADC input pin 8
.equ ADC_MUXNEG_AIN9_gc = (0x09<<0)      ; ADC input pin 9
.equ ADC_MUXNEG_AIN10_gc = (0x0A<<0)     ; ADC input pin 10
.equ ADC_MUXNEG_AIN11_gc = (0x0B<<0)     ; ADC input pin 11
.equ ADC_MUXNEG_AIN12_gc = (0x0C<<0)     ; ADC input pin 12
.equ ADC_MUXNEG_AIN13_gc = (0x0D<<0)     ; ADC input pin 13
.equ ADC_MUXNEG_AIN14_gc = (0x0E<<0)     ; ADC input pin 14
.equ ADC_MUXNEG_AIN15_gc = (0x0F<<0)     ; ADC input pin 15
.equ ADC_MUXNEG_GND_gc = (0x40<<0)       ; Ground
.equ ADC_MUXNEG_DAC0_gc = (0x48<<0)      ; DAC0

; Analog Channel Selection Bits
.equ ADC_MUXPOS_AIN0_gc = (0x00<<0)      ; ADC input pin 0
.equ ADC_MUXPOS_AIN1_gc = (0x01<<0)      ; ADC input pin 1
.equ ADC_MUXPOS_AIN2_gc = (0x02<<0)      ; ADC input pin 2
.equ ADC_MUXPOS_AIN3_gc = (0x03<<0)      ; ADC input pin 3
.equ ADC_MUXPOS_AIN4_gc = (0x04<<0)      ; ADC input pin 4
.equ ADC_MUXPOS_AIN5_gc = (0x05<<0)      ; ADC input pin 5
.equ ADC_MUXPOS_AIN6_gc = (0x06<<0)      ; ADC input pin 6
.equ ADC_MUXPOS_AIN7_gc = (0x07<<0)      ; ADC input pin 7
.equ ADC_MUXPOS_AIN8_gc = (0x08<<0)      ; ADC input pin 8
.equ ADC_MUXPOS_AIN9_gc = (0x09<<0)      ; ADC input pin 9
.equ ADC_MUXPOS_AIN10_gc = (0x0A<<0)     ; ADC input pin 10
.equ ADC_MUXPOS_AIN11_gc = (0x0B<<0)     ; ADC input pin 11
.equ ADC_MUXPOS_AIN12_gc = (0x0C<<0)     ; ADC input pin 12
.equ ADC_MUXPOS_AIN13_gc = (0x0D<<0)     ; ADC input pin 13
.equ ADC_MUXPOS_AIN14_gc = (0x0E<<0)     ; ADC input pin 14
.equ ADC_MUXPOS_AIN15_gc = (0x0F<<0)     ; ADC input pin 15
.equ ADC_MUXPOS_AIN16_gc = (0x10<<0)     ; ADC input pin 16
.equ ADC_MUXPOS_AIN17_gc = (0x11<<0)     ; ADC input pin 17
.equ ADC_MUXPOS_AIN18_gc = (0x12<<0)     ; ADC input pin 18
.equ ADC_MUXPOS_AIN19_gc = (0x13<<0)     ; ADC input pin 19
.equ ADC_MUXPOS_AIN20_gc = (0x14<<0)     ; ADC input pin 20
.equ ADC_MUXPOS_AIN21_gc = (0x15<<0)     ; ADC input pin 21
.equ ADC_MUXPOS_GND_gc = (0x40<<0)       ; Ground
.equ ADC_MUXPOS_TEMPSENSE_gc = (0x42<<0) ; Temperature sensor
.equ ADC_MUXPOS_VDDDIV10_gc = (0x44<<0)  ; VDD/10
.equ ADC_MUXPOS_VDDIO2DIV10_gc = (0x45<<0) ; VDDIO2/10
.equ ADC_MUXPOS_DAC0_gc = (0x48<<0)      ; DAC0


;*************************************************************************
;** BOD - Bod interface
;*************************************************************************

; BOD_CTRLA masks
.equ BOD_SLEEP_gm = 0x03                 ; Operation in sleep mode group mask
.equ BOD_SLEEP_gp = 0                    ; Operation in sleep mode group position
.equ BOD_SLEEP_0_bm = (1<<0)             ; Operation in sleep mode bit 0 mask
.equ BOD_SLEEP_0_bp = 0                  ; Operation in sleep mode bit 0 position
.equ BOD_SLEEP_1_bm = (1<<1)             ; Operation in sleep mode bit 1 mask
.equ BOD_SLEEP_1_bp = 1                  ; Operation in sleep mode bit 1 position
.equ BOD_ACTIVE_gm = 0x0C                ; Operation in active mode group mask
.equ BOD_ACTIVE_gp = 2                   ; Operation in active mode group position
.equ BOD_ACTIVE_0_bm = (1<<2)            ; Operation in active mode bit 0 mask
.equ BOD_ACTIVE_0_bp = 2                 ; Operation in active mode bit 0 position
.equ BOD_ACTIVE_1_bm = (1<<3)            ; Operation in active mode bit 1 mask
.equ BOD_ACTIVE_1_bp = 3                 ; Operation in active mode bit 1 position
.equ BOD_SAMPFREQ_bm = 0x10              ; Sample frequency bit mask
.equ BOD_SAMPFREQ_bp = 4                 ; Sample frequency bit position

; BOD_CTRLB masks
.equ BOD_LVL_gm = 0x07                   ; Bod level group mask
.equ BOD_LVL_gp = 0                      ; Bod level group position
.equ BOD_LVL_0_bm = (1<<0)               ; Bod level bit 0 mask
.equ BOD_LVL_0_bp = 0                    ; Bod level bit 0 position
.equ BOD_LVL_1_bm = (1<<1)               ; Bod level bit 1 mask
.equ BOD_LVL_1_bp = 1                    ; Bod level bit 1 position
.equ BOD_LVL_2_bm = (1<<2)               ; Bod level bit 2 mask
.equ BOD_LVL_2_bp = 2                    ; Bod level bit 2 position

; BOD_VLMCTRLA masks
.equ BOD_VLMLVL_gm = 0x03                ; voltage level monitor level group mask
.equ BOD_VLMLVL_gp = 0                   ; voltage level monitor level group position
.equ BOD_VLMLVL_0_bm = (1<<0)            ; voltage level monitor level bit 0 mask
.equ BOD_VLMLVL_0_bp = 0                 ; voltage level monitor level bit 0 position
.equ BOD_VLMLVL_1_bm = (1<<1)            ; voltage level monitor level bit 1 mask
.equ BOD_VLMLVL_1_bp = 1                 ; voltage level monitor level bit 1 position

